a = int(input("Введите целое число A: "))
b = int(input("Введите целое число B: "))
c = int(input("Введите целое число C: "))

if (a >=1 and a <=3):
    print( str(a) + " - принадлежит интервалу [1,3]")
else:
    print(str(a) + " - не принадлежит интервалу [1,3]")
if (b >=1 and b <=3):
    print( str(b) + " - принадлежит интервалу [1,3]")
else:
    print(str(b) + " - не принадлежит интервалу [1,3]")
if (c >=1 and c <=3):
    print(str(c) + " - принадлежит интервалу [1,3]")
else:
    print(str(c) + " - не принадлежит интервалу [1,3]")